docs/relatorio.tex
% Created 2022-05-04 qua 08:45
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}

\usepackage{amsthm}
\theoremstyle{definition}
\newtheorem{teo}{Teorema}[section]
\theoremstyle{definition}
\newtheorem{defi}{Definicao}[section]
\theoremstyle{remark}
\newtheorem{obs}{Observação}[section]
\theoremstyle{remark}
\newtheorem{lema}{Lema}[section]
\theoremstyle{remark}
\newtheorem{prop}{Propriedade}[section]
\theoremstyle{remark}
\newtheorem{coro}{Corolario}[section]
\theoremstyle{definition}
\newtheorem{prep}{Preposição}[section]
\author{Ieremies Romero, Marcão}
\date{\today}
\title{MC833 - Relatório do Projeto 1}
\hypersetup{
 pdfauthor={Ieremies Romero, Marcão},
 pdftitle={MC833 - Relatório do Projeto 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.6)}, 
 pdflang={Portuguese}}
\usepackage{biblatex}
\addbibresource{~/arq/bib.bib}
\begin{document}

\maketitle
\tableofcontents


\section{Introdução}
\label{sec:org063043b}
Este projeto tem como o objetivo desenvolver uma comunicação cliente-servidor utilizando uma conexão TCP. Para isso, utilizamos um servidor concorrente capaz de fornecer, guardar e atualizar informações sobre filmes. O cliente, é capaz de recuperar ou alterar essas informações via protocolo HTTP de \texttt{GET} ou \texttt{PUT}.
\section{Descrição}
\label{sec:org3c377cb}


\section{Casos de uso}
\label{sec:org0ad9fc9}
Nosso servidor serve para fornecer uma lista de filme e suas informações.
\section{Armazenamento e estruturas de dados}
\label{sec:orgbcfd810}
As informações armazenadas estão contidas no arquivo \texttt{data/movie.h} que contém a \texttt{struct Movie} composta dos seguintes campos:
\begin{description}
\item[{id}] Um identificador numérico único.
\item[{title}] Uma string contendo o título do filme.
\item[{num\textsubscript{genres}}] A quantidade de gêneros cadastrados ao filme.
\item[{genre\textsubscript{list}}] Os gêneros cadastrados ao filme.
\item[{director\textsubscript{name}}] Uma string contendo o nome do diretor.
\item[{year}] O ano de publicação do filme.

Para armazenar uma lista de filmes, possuímos a \texttt{struct Catalog} definida no arquivo \texttt{data/Catalog.h} que se resume a um vetor de \texttt{struct Movie} e o indicador de quantos filmes a lista contém (\texttt{size}).
\end{description}
\section{Implementação}
\label{sec:org4385817}
\subsection{Servidor}
\label{sec:orgeaee4e9}
No lado do servidor, começamos populando a \texttt{struct addrinf} com algumas informações e passando-a para a função \texttt{getaddrinfo()} que nos retorna uma lista ligada de IP's disponíveis. Como indicado \ref{tutorial}, iteramos pelas possibilidades recuperando o socket descriptor, conferimos se está totalmente livre para ser utilizado com \texttt{setsockopt} e nos conectamos ao primeiro disponível com \texttt{bind()}.

Caso tudo isso tenha sido feito com êxito, podemos garantir que processos zombies serão tratados e avisar que o socket será limpo, antes de, finalmente, começar a escutar por conexões. No laço \texttt{while}, aceitamos novas conexões com \texttt{accept()} e executamos \texttt{handle\_client()}, função responsável por agir em vista das requisições do cliente.
\subsection{Cliente}
\label{sec:orgd62d940}
\section{Conclusão}
\label{sec:org2124d37}
\end{document}
